mboros1/esp_raii_lib/sdkconfig.defaults
# Default configuration for ESP32
CONFIG_IDF_TARGET="esp32"

# DISABLE C++ exceptions for zero-cost abstractions
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# DISABLE C++ RTTI for smaller binary size
CONFIG_COMPILER_CXX_RTTI=n

# Optimization level - optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS stats (optional, can be disabled for production)
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=n
CONFIG_FREERTOS_USE_TRACE_FACILITY=n
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=n